#+TITLE: Recon Lab: Censys.io
#+DATE: Introduction
#+AUTHOR: Zach Roof
#+OPTIONS: num:nil toc:nil
#+OPTIONS: reveal_center:nil reveal_control:t width:100% height:100%
#+OPTIONS: reveal_history:nil reveal_keyboard:t reveal_overview:t
#+OPTIONS: reveal_slide_number:"c"
#+OPTIONS: reveal_title_slide:"<h2>%t</h2><h3>%d<h3>"
#+OPTIONS: reveal_progress:t reveal_rolling_links:nil reveal_single_file:nil
#+REVEAL_HLEVEL: 1
#+REVEAL_MARGIN: 0
#+REVEAL_MIN_SCALE: 1
#+REVEAL_MAX_SCALE: 1
#+REVEAL_ROOT: file:///Users/zachroof/repos/sts-reveal.js
#+REVEAL_TRANS: default
#+REVEAL_SPEED: default
#+REVEAL_THEME: laravel
#+REVEAL_PLUGINS: notes
#+REVEAL_EXTRA_CSS: file:///Users/zachroof/repos/weekly-sts-in-prog/local.css
# TODO FT:Security-Controls, nmap
# Add in Errata doc and rephrase it's existance in the first lecture
# Link to this in all show notes
# Think about changing name to Censys and HTTP headers or Censys and recon techniques?
** Caching Vulns Intro: Tutorial Scope
   :LOGBOOK:
   CLOCK: [2017-11-14 Tue 09:13]--[2017-11-14 Tue 09:38] =>  0:25
   CLOCK: [2017-11-11 Sat 11:28]--[2017-11-11 Sat 11:53] =>  0:25
   :END:
- Leverage Censys to find ~Cache-Control~ header misconfiguration
- Focus on ~Cache-Control~, but there are other headers involved
  in caching
  - ~Pragma~
  - ~Expires~

** Caching Vulns Intro: ~GET~ Caching Vulnerability Exs.
   :LOGBOOK:
   CLOCK: [2017-11-14 Tue 09:50]--[2017-11-14 Tue 10:15] =>  0:25
   :END:
1. Sensitive token within API route
   + https://example.com/256993ac-ba65-11e7-8e6d-0242ac110003/profile
     + Go to this route in incognito mode.  Are you still authenticated?
2. Sensitive token within query string parameters
   + https://example.com/profile?sid=256993ac-ba65-11e7-8e6d-0242ac110003&fst=1jshdjk-js1s-ejsl-jd18-jd73jsks7
   + Certain web frameworks pass the session id via query string parameters
     - Ex. Php
     - Gives compatibility to browsers that disable cookies
   + We'll leverage Censys to uncover this type of caching vulnerability in hackthissite
     + Before we get there, we need a little more background information
